[
    {
        "id":1,
        "chef_name":"Sanjeev Kapoor",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india1.jpg","years_of_experience":17,"number_of_rcipes": 9,
        "bio": "Sanjeev Kapoor is the most famous and commended chef in India. He is also an entrepreneur and a television personality. Sanjeev works for a TV channel named 'FoodFood' after which he became the world's first chef who owns a 24×7 food and lifestyle channel. He also hosted the television show 'Khana Khazana,' which was Asia's longest-running show at the time. The event was broadcast in 120 countries and received over 500 million viewers in 2010. Indian food is his cooking style. Mr. Kapoor was born in Ambala, Haryana, India, on April 10, 1964. He began his career in the hospitality sector in 1984. Alyona Kapoor, his wife, is also a partner in his company, Turmeric Vision Pvt. Ltd. Sanjeev Kapoor joined the Centaur Hotel in Mumbai as the youngest Executive Chef in 1992.",
        "total_likes": "4.3k",
        "recipes": [
            {
            "name": "Butter Chicken",
            "ingredients": ["Chicken", "Butter", "Tomatoes", "Onion", "Cream"],
            "method": "1. Marinate chicken with yogurt, salt, and spices. \n2. Grill the chicken and set aside. \n3. In a pan, sauté onion until golden brown. \n4. Add tomatoes, ginger, garlic, and spices. \n5. Cook for a few minutes until the tomatoes soften. \n6. Add cream and butter. \n7. Add grilled chicken and cook for a few minutes. \n8. Garnish with coriander leaves and serve hot.",
            "rating": 4.5
            },
            {
            "name": "Palak Paneer",
            "ingredients": ["Spinach", "Paneer", "Onion", "Tomato", "Ginger"],
            "method": "1. Blanch spinach leaves and blend them into a puree. \n2. In a pan, sauté onion, ginger, and tomato. \n3. Add spinach puree and cook for a few minutes. \n4. Add paneer and cook for a few more minutes. \n5. Garnish with cream and serve hot.",
            "rating": 4.0
            },
            {
            "name": "Chole Bhature",
            "ingredients": ["Chickpeas", "Flour", "Onion", "Tomato", "Ginger"],
            "method": "1. Soak chickpeas overnight and boil until tender. \n2. In a pan, sauté onion, ginger, and tomato. \n3. Add boiled chickpeas and spices. \n4. Cook for a few minutes. \n5. For Bhature, mix flour, yogurt, and spices to make a dough. \n6. Roll out the dough into flat circles and deep fry. \n7. Serve hot with chole.",
            "rating": 4.2
            }
        ]
    },

    {
        "id":2,
        "chef_name":"Ranveer Brar",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india3.jpg","years_of_experience":5,"number_of_rcipes":11,
        "bio": "Ranveer Brar is an Indian chef, TV & digital celebrity, judge, host, author, restaurateur, food film producer, and benefactor. He was born on 8 February 1978 in Lucknow, Uttar Pradesh, India. At present, he is engaged as the senior official food expert at the Novotel Mumbai, Juhu Beach. Other than this, he is also a supervisor at the Dosa Factory and Shalimar in Cambridge. He began his career at the Taj Hotel, Mumbai after completing his education at IHM, Lucknow. Mr. Brar started his TV career with Breakfast Xpress. He has appeared in various shows as a judge or host such as Zee Khana Khazana, Zoom's Thank Got Its Friday, Masterchef India, Raja Rasoi Aur Andaaz Anokha, Rasoi ki Jung Mummiyon ke Sung, Health Bhi Taste Bhi, and others. In 2016, Ranveer Brar launched his first book titled 'Come Into My Kitchen' an autobiography. Other than this, in 2019, he launched his mobile app also.",
        "total_likes":"15.7k",
        "recipes": [
            {
            "name": "Chicken Tikka Masala",
            "ingredients": [
                "Chicken",
                "Tomatoes",
                "Onion",
                "Yogurt",
                "Garam Masala"
            ],
            "method": "1. Marinate chicken with yogurt, salt, and spices. \n2. Grill the chicken and set aside. \n3. In a pan, sauté onion until golden brown. \n4. Add tomatoes, ginger, garlic, and spices. \n5. Cook for a few minutes until the tomatoes soften. \n6. Add grilled chicken and cook for a few minutes. \n7. Garnish with coriander leaves and serve hot.",
            "rating": 4.8
            },
            {
            "name": "Aloo Gobi",
            "ingredients": [
                "Potatoes",
                "Cauliflower",
                "Onion",
                "Tomato",
                "Cumin Seeds"
            ],
            "method": "1. Boil potatoes and cauliflower separately. \n2. In a pan, sauté onion, cumin seeds, and tomato. \n3. Add boiled potatoes and cauliflower. \n4. Add spices and cook for a few minutes. \n5. Serve hot with rice or naan.",
            "rating": 4.2
            },
            {
            "name": "Rajma Chawal",
            "ingredients": [
                "Kidney Beans",
                "Onion",
                "Tomato",
                "Ginger",
                "Rice"
            ],
            "method": "1. Soak kidney beans overnight and boil until tender. \n2. In a pan, sauté onion, ginger, and tomato. \n3. Add boiled kidney beans and spices. \n4. Cook for a few minutes. \n5. For rice, wash and soak rice for 30 minutes. \n6. Cook rice in a pot of boiling water. \n7. Serve hot with rajma.",
            "rating": 4.5
            }
        ]
    },


    {
        "id":3,
        "chef_name":"Hari Nayak",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india6.jpg","years_of_experience":8,"number_of_rcipes":13,
        "bio": "Hari Nayak is a New York-based Indian chef, author, restaurateur, and culinary consultant. He was born on 8 February 1974 in Udupi, Karnataka, India. He completed his education at Welcome group Graduate School of Hotel Administration, Karnataka, and then started his journey from the Culinary Institute of America. He is the author of 7 bestselling books including Modern Indian Cooking. His latest launched book is Spice Trail. Several restaurants run by him are Sona, Jhol, Charcoza, Alchemy, Masti, CafeSpice, and Bombay Bungalow at various locations in the world. From them, Sona in New York was collectively opened by Hari, his friend Maneesh, and Bollywood and Hollywood actress Priyanka Chopra. He is the co-founder of 'Cooking for Life'.",
        "total_likes":"129k",
        "recipes": [
            {
            "name": "Baingan Bharta",
            "ingredients": [
                "Eggplant",
                "Tomatoes",
                "Onion",
                "Garlic",
                "Ginger"
            ],
            "method": "1. Roast eggplant until the skin is charred and the flesh is soft. \n2. Peel off the skin and mash the flesh. \n3. In a pan, sauté onion, garlic, and ginger. \n4. Add tomatoes and cook until they soften. \n5. Add mashed eggplant and spices. \n6. Cook for a few minutes. \n7. Garnish with coriander leaves and serve hot with naan or rice.",
            "rating": 4.3
            },
            {
            "name": "Paneer Makhani",
            "ingredients": [
                "Paneer",
                "Tomatoes",
                "Butter",
                "Cream",
                "Kasuri Methi"
            ],
            "method": "1. In a pan, sauté paneer until golden brown. \n2. Set aside. \n3. In the same pan, sauté onion until golden brown. \n4. Add tomatoes and cook until they soften. \n5. Add butter and cream. \n6. Cook for a few minutes. \n7. Add paneer and kasuri methi. \n8. Cook for a few more minutes. \n9. Garnish with cream and serve hot with naan or rice.",
            "rating": 4.7
            },
            {
            "name": "Chana Masala",
            "ingredients": [
                "Chickpeas",
                "Onion",
                "Tomatoes",
                "Ginger",
                "Coriander"
            ],
            "method": "1. Soak chickpeas overnight and boil until tender. \n2. In a pan, sauté onion and ginger. \n3. Add tomatoes and cook until they soften. \n4. Add boiled chickpeas and spices. \n5. Cook for a few minutes. \n6. Garnish with coriander leaves and serve hot with rice or naan.",
            "rating": 4.2
            }
        ]
    },

    {
        "id":4,
        "chef_name":"Vineet Bhatia",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india7.jpg","years_of_experience":13,"number_of_rcipes":22,
        "bio": "Vineet Bhatia is an Indian chef, restaurateur, author, and media personality. He was born on 9 December 1967in Mumbai, Maharashtra, India. He was the first Indian chef who received a Michelin Star Award and the only Indian who was awarded the prize two times. He completed his education at The Oberoi School of Hotel Management. His cooking style is modern Indian. He was the judge on the Netflix show The Final Table and judge-host on MasterChef India. His published cookbooks are Rasoi: New Indian Kitchen and My Sweet Kitchen. Mr. Bhatia is the owner of eleven restaurants also.",
        "total_likes":"300k",
        "recipes": [
            {
            "name": "Masala Dosa",
            "ingredients": [
                "Rice",
                "Urad Dal",
                "Potatoes",
                "Onion",
                "Green Chilies"
            ],
            "method": "1. Soak rice and urad dal separately overnight. \n2. Grind them into a smooth batter. \n3. Ferment the batter overnight. \n4. In a pan, sauté onion and green chilies. \n5. Add mashed potatoes and spices. \n6. Cook for a few minutes. \n7. Heat a dosa pan and spread the batter. \n8. Add oil and cook until the bottom is golden brown. \n9. Flip and cook the other side. \n10. Serve hot with chutney and sambar.",
            "rating": 4.9
            },
            {
            "name": "Idli",
            "ingredients": [
                "Rice",
                "Urad Dal",
                "Fenugreek Seeds",
                "Salt",
                "Water"
            ],
            "method": "1. Soak rice, urad dal, and fenugreek seeds separately overnight. \n2. Grind them into a smooth batter. \n3. Ferment the batter overnight. \n4. Add salt to the batter. \n5. Pour the batter into greased idli molds. \n6. Steam the idlis for 10-12 minutes. \n7. Serve hot with chutney and sambar.",
            "rating": 4.6
            },
            {
            "name": "Coconut Chutney",
            "ingredients": [
                "Coconut",
                "Green Chilies",
                "Ginger",
                "Roasted Chana Dal",
                "Salt"
            ],
            "method": "1. Grind coconut, green chilies, ginger, roasted chana dal, and salt. \n2. Add water and grind to a smooth paste. \n3. Temper with mustard seeds, urad dal, curry leaves, and red chilies. \n4. Serve with dosa, idli, or vada.",
            "rating": 4.4
            }
        ]
    },


    {
        "id":5,
        "chef_name":"Harpal Singh Sokhi",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india10.jpg","years_of_experience":9,"number_of_rcipes":14,
        "bio": "Harpal Singh Sokhi is an Indian chef, restaurateur, author, and entrepreneur. He was born in 1966 in Kharagpur, West Bengal, India. He worked as a chef with various hotels and restaurant chains. Later, in 2013, he started his chain 'The Punjabi Tadka'. Other than this, he has hosted the show Turban Tadka. He is very popular for his famous phrase and song 'Namak Shamak'. His cooking style is Indian cuisine. At the beginning of his career, he worked at The Oberoi in Bhubaneswar. Sokhi has organized the Indian Food Festivals internationally. In 2001, he founded Khana Khazana Pvt. Ltd with others. He has also worked as a guest teacher at the N. L. Dalmia Institute of Management Studies and Research. He was also a participant at Jhalak Dikhla Jaa 9. Mr. Harpal has written food columns and a book titled 'Royal Hyderabadi Cooking' (authored with Sanjeev Kapoor).",
        "total_likes":"211k",
        "recipes": [
            {
            "name": "Undhiyu",
            "ingredients": [
                "Potatoes",
                "Eggplant",
                "Beans",
                "Peas",
                "Corn"
            ],
            "method": "1. Cut potatoes and eggplant into cubes. \n2. Cut beans into 2 inch pieces. \n3. Mix potatoes, eggplant, beans, peas, corn, and spices. \n4. Stuff the mixture into a clay pot. \n5. Cover and cook on low heat for 30-40 minutes. \n6. Serve hot with puri.",
            "rating": 4.5
            },
            {
            "name": "Khandvi",
            "ingredients": [
                "Besan",
                "Curd",
                "Ginger",
                "Green Chilies",
                "Coconut"
            ],
            "method": "1. Mix besan, curd, ginger, green chilies, and water. \n2. Cook the mixture on low heat until it thickens. \n3. Pour the mixture onto a greased surface and spread it thin. \n4. Let it cool and set. \n5. Cut into thin strips. \n6. Temper with mustard seeds, sesame seeds, and coconut. \n7. Serve garnished with coriander leaves.",
            "rating": 4.2
            },
            {
            "name": "Dhokla",
            "ingredients": [
                "Besan",
                "Curd",
                "Ginger",
                "Green Chilies",
                "Eno Fruit Salt"
            ],
            "method": "1. Mix besan, curd, ginger, green chilies, and water. \n2. Add eno fruit salt and mix well. \n3. Pour the batter into a greased container. \n4. Steam for 10-12 minutes. \n5. Temper with mustard seeds, sesame seeds, and curry leaves. \n6. Serve hot with chutney.",
            "rating": 4.3
            }
        ]
    },

    {
        "id":6,
        "chef_name":"Saransh Goila",
        "profile_image":"https://static.javatpoint.com/top10-technologies/images/top-10-chefs-in-india9.jpg","years_of_experience":11,"number_of_rcipes":6,
        "bio": "Saransh Goila is an Indian chef and restaurateur. He was born on 17 February 1987 in Delhi, India. He completed his education at the Institute of Hotel Management, Aurangabad. His cooking style is Indian cuisine. Mr. Saransh is the owner of 'Goila Butter Chicken' located in Mumbai and also the author of the acclaimed travelogue 'India on my Platter'. He is the host of TV shows Roti Rasta aur India and Healthy Fridge. In 2013, he became a participant in the show Sanjeev Kapoor ke Kitchen Khiladi also. In 2018, he was the host of the web series 'Run to Eat'.",
        "total_likes":"600k",
        "recipes": [
            {
            "name": "Vada Pav",
            "ingredients": [
                "Potatoes",
                "Garlic",
                "Green Chilies",
                "Ginger",
                "Buns"
            ],
            "method": "1. Boil and mash the potatoes. \n2. Sauté garlic, green chilies, and ginger. \n3. Add the mashed potatoes and spices. \n4. Make potato patties and fry until golden brown. \n5. Serve the patties in a bun with chutney and fried green chilies.",
            "rating": 4.7
            },
            {
            "name": "Pani Puri",
            "ingredients": [
                "Semolina",
                "Potatoes",
                "Chickpeas",
                "Mint",
                "Tamarind"
            ],
            "method": "1. Mix semolina with water to make a dough. \n2. Roll out small balls and deep fry until crispy. \n3. Stuff the balls with potatoes and chickpeas. \n4. Make a mint and tamarind water. \n5. Make a small hole in each ball and fill it with the water. \n6. Serve immediately.",
            "rating": 4.8
            },
            {
            "name": "Samosa",
            "ingredients": [
                "Potatoes",
                "Peas",
                "Flour",
                "Spices",
                "Oil"
            ],
            "method": "1. Boil and mash the potatoes. \n2. Sauté peas and spices. \n3. Mix the potatoes and peas together. \n4. Make a dough with flour and water. \n5. Roll out the dough and cut it into triangles. \n6. Stuff each triangle with the potato and pea mixture. \n7. Deep fry until golden brown. \n8. Serve hot with chutney.",
            "rating": 4.6
            }
        ]
    }
]